snlkuharlocal/src/DataProcessors/УстановкаАктивностиИВыгрузкиНаСайтНоменклатуры/УстановкаАктивностиИВыгрузкиНаСайтНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УстановкаАктивностиИВыгрузкиНаСайтНоменклатуры</name>
</mdclass:DataProcessor>

snlkuharlocal/src/AccumulationRegisters/ОстаткиТМЦ/ОстаткиТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДК</name>
    <type>
      <types>CatalogRef.ДисконтныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидкиУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/РезервыТМЦ/РезервыТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РезервыТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.Заказ</types>
      <types>DocumentRef.ПредварительныйЗаказКлиента</types>
      <types>DocumentRef.ПродажаИМ</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ВиртуальныйРезерв</types>
      <types>DocumentRef.ЗаявкаНаПерепаковку</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Брэнд</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТовара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Прайс</name>
    <type>
      <types>DocumentRef.ПрайсЛист</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ВидыКомплектов/ВидыКомплектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКомплектов</name>
  <enumValues>
    <name>Комплект</name>
  </enumValues>
  <enumValues>
    <name>Ассортито</name>
  </enumValues>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>ГотовыйКомплект</name>
  </enumValues>
  <enumValues>
    <name>АссортитоКомплектов</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыНоменклаутры/ВидыНоменклаутры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклаутры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ОсновноеСредство</name>
  </enumValues>
  <enumValues>
    <name>МБП</name>
  </enumValues>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
  <enumValues>
    <name>КомпьютернаяТехника</name>
  </enumValues>
  <enumValues>
    <name>РекламаПлатная</name>
  </enumValues>
  <enumValues>
    <name>РекламаБесплатная</name>
  </enumValues>
  <enumValues>
    <name>Упаковка</name>
  </enumValues>
  <enumValues>
    <name>ТМЦнаОтветственномХранении</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ЖизненныйЦиклНоменклатуры/ЖизненныйЦиклНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЖизненныйЦиклНоменклатуры</name>
  <enumValues>
    <name>Активна</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВыгружатьНаСайт/ВыгружатьНаСайт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВыгружатьНаСайт</name>
  <enumValues>
    <name>Да</name>
  </enumValues>
  <enumValues>
    <name>Нет</name>
  </enumValues>
  <enumValues>
    <name>КогдаКак</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/НастройкиОбменаМонобрендовыхСайтов/НастройкиОбменаМонобрендовыхСайтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиОбменаМонобрендовыхСайтов</name>
  <attributes>
    <name>УзелОбмена</name>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Узлы</name>
    <attributes>
      <name>БрендФР</name>
      <type>
        <types>CatalogRef.ФР_Бренды</types>
      </type>
    </attributes>
    <attributes>
      <name>Активность</name>
      <type>
        <types>EnumRef.ВыгружатьНаСайт</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/DataProcessors/УстановкаАктивностиИВыгрузкиНаСайтНоменклатуры/ObjectModule.bsl
Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт
	
	МассивСкладов=новый Массив; 
	МассивКоллекцийОсновной=новый Массив;
	МассивКоллекцийРаспродажный=новый Массив;
	МассивКоллекцийОбщий=новый Массив;  //МассивКоллекцийРаспродажный+МассивКоллекцийОсновной
	МассивНоменклатуры=новый Массив;
	//крохин начало 06.12.2022
	МассивКоллекцийСтильпарк = новый Массив;
	МассивЕмайлов = новый Массив;
		
	//крохин конец 06.12.2022
	СтрокаПараметров="";
	//ТипЦен1 = неопределено;
	//ТипЦен2 = Неопределено;
		
	// Кухарь А.Ю.  27.12.2023 начало
	МассивУстаревшейНоменклатуры = новый Массив; 
	// Кухарь А.Ю.  27.12.2023 конец
	
	
	Если ТаблицаПараметров = Неопределено Тогда
	КонецЕсли;
	
	СтароеИмяПараметра="";
	Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл
		
		НовоеИмяПараметра="Параметр: "+СтрокаТП.Имя+" - ";
		если СтароеИмяПараметра<>НовоеИмяПараметра тогда
			ИмяПараметра=НовоеИмяПараметра;
		иначе
			ИмяПараметра="";
		КонецЕсли;
		
		СтрокаПараметров=СтрокаПараметров+", "+ИмяПараметра+СтрокаТП.Значение; 
		
		Если СтрокаТП.Имя = "Склад" Тогда			
			МассивСкладов.Добавить(СтрокаТП.Значение);
		ИначеЕсли  СтрокаТП.Имя = "Номенклатура" Тогда			
			//МассивНоменклатуры.Добавить(СтрокаТП.Значение);   // Шворобей ВЮ 20.09.2023 ++
		ИначеЕсли  СтрокаТП.Имя = "КоллекцияОсновная" Тогда			
			МассивКоллекцийОсновной.Добавить(СтрокаТП.Значение);	
			МассивКоллекцийОбщий.Добавить(СтрокаТП.Значение);	
		ИначеЕсли  СтрокаТП.Имя = "КоллекцияРаспродажная" Тогда			
			МассивКоллекцийРаспродажный.Добавить(СтрокаТП.Значение);
			МассивКоллекцийОбщий.Добавить(СтрокаТП.Значение);
			//крохин начало 06.12.2022
		ИначеЕсли  СтрокаТП.Имя = "КоллекцияСтильпарк" Тогда			
			МассивКоллекцийСтильпарк.Добавить(СтрокаТП.Значение);
			МассивКоллекцийОсновной.Добавить(СтрокаТП.Значение);
			МассивКоллекцийОбщий.Добавить(СтрокаТП.Значение);
			//крохин конец 06.12.202
			// Кухарь А.Ю.  27.12.2023 начало
		ИначеЕсли  СтрокаТП.Имя = "УстаревшаяНоменклатура" Тогда
			МассивУстаревшейНоменклатуры.Добавить(СтрокаТП.значение);
			// Кухарь А.Ю.  27.12.2023 конец
			// Нечаева 10,01,23++
		ИначеЕсли  СтрокаТП.Имя = "Емайл" Тогда
			МассивЕмайлов.Добавить(СтрокаТП.значение);
		ИначеЕсли  СтрокаТП.Имя = "ТипЦен1" Тогда
			ТипЦен1 = СтрокаТП.значение;
		ИначеЕсли  СтрокаТП.Имя = "ТипЦен2" Тогда
			ТипЦен2 = СтрокаТП.значение;
			// Нечаева 10,01,23--	
		КонецЕсли;
		СтароеИмяПараметра=НовоеИмяПараметра;
	КонецЦикла;
	
	
	// Шворобей ВЮ 20.09.2023 ++
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ТоварнаяГруппаВерхнегоУровня
	|	И Номенклатура.ЭтоГруппа
	|	И НЕ Номенклатура.ПометкаУдаления";
	
	УстановитьПривилегированныйРежим(Истина);
	МассивНоменклатуры = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
	УстановитьПривилегированныйРежим(Ложь);
	// Шворобей ВЮ 20.09.2023 ++
	
	МассивВидовКомплекта=новый Массив;
	МассивВидовКомплекта.Добавить(Перечисления.ВидыКомплектов.Комплект);
	МассивВидовКомплекта.Добавить(Перечисления.ВидыКомплектов.Ассортито);
	МассивВидовКомплекта.Добавить(Перечисления.ВидыКомплектов.АссортитоКомплектов);
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	//Сначала ставим  активность на элементы из МассивКоллекцийРаспродажный + МассивКоллекцийОсновной, который есть на остатках (1я вложенная табличка)
	//+  ставим активность на элементы из МассивКоллекцийОсновной, который  не снят с производства   (2я вложенная табличка)
	// МассивКоллекцийОбщий это МассивКоллекцийРаспродажный+МассивКоллекцийОсновной 
	
	Запрос = Новый Запрос;
	// Шворобей ВЮ 29.08.2023 ++
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	т1.Номенклатура КАК Номенклатура
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	|		СУММА(ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0)) КАК КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.ОстаткиТМЦ.Остатки(
	|				&Дата2,
	|				Склад В (&МассивСкладов)
//крохин начало 07.05.2024
//опечатка
//	|					И Номенклатура В ИЕРАРХИИ (&МассивКоллекцийРаспродажный)
    |					И Номенклатура.Ссылка В ИЕРАРХИИ (&МассивНоменклатуры)
//крохин конец 07.05.2024
	|					И Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	|					И Номенклатура.Родитель.Коллекция В (&МассивКоллекцийОбщий)
	|					И НЕ Номенклатура.ВидКомплекта В (&МассивВидовКомплекта)
	|					И НЕ Номенклатура.ЭтоГруппа
	|					И Номенклатура.ЖизненныйЦиклНоменклатуры <> ЗНАЧЕНИЕ(перечисление.ЖизненныйЦиклНоменклатуры.Активна)) КАК ОстаткиТМЦОстатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	|					&Дата2,
	|					Склад В (&МассивСкладов)
//крохин начало 07.05.2024
//опечатка	
//	|						И Номенклатура В ИЕРАРХИИ (&МассивКоллекцийРаспродажный)
    |				     	И Номенклатура.Ссылка В ИЕРАРХИИ (&МассивНоменклатуры)
//крохин конец 07.05.2024
	|						И Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	|						И Номенклатура.Родитель.Коллекция В (&МассивКоллекцийОбщий)
	|						И НЕ Номенклатура.ВидКомплекта В (&МассивВидовКомплекта)
	|						И НЕ Номенклатура.ЭтоГруппа
	|						И Номенклатура.ЖизненныйЦиклНоменклатуры <> ЗНАЧЕНИЕ(перечисление.ЖизненныйЦиклНоменклатуры.Активна)) КАК РезервыТМЦОстатки
	|			ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
	|				И ОстаткиТМЦОстатки.Склад = РезервыТМЦОстатки.Склад
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ОстаткиТМЦОстатки.Номенклатура
	|	
	|	ИМЕЮЩИЕ
	|		СУММА(ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0)) > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Номенклатура.Ссылка,
	|		0
	|	ИЗ
	|		Справочник.Номенклатура КАК Номенклатура
	|	ГДЕ
	|		НЕ Номенклатура.ПометкаУдаления
	|		И НЕ Номенклатура.СнятСПроизводства
	|		И Номенклатура.Ссылка В ИЕРАРХИИ(&МассивНоменклатуры)
	|		И Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	|		И Номенклатура.Родитель.Коллекция В(&МассивКоллекцийОсновной)
	|		И НЕ Номенклатура.ВидКомплекта В (&МассивВидовКомплекта)
	|		И Номенклатура.ЖизненныйЦиклНоменклатуры <> ЗНАЧЕНИЕ(перечисление.ЖизненныйЦиклНоменклатуры.Активна)
	|		И НЕ Номенклатура.ЭтоГруппа) КАК т1";
	// Шворобей ВЮ 29.08.2023 ++
	
	запрос.УстановитьПараметр("МассивНоменклатуры",МассивНоменклатуры);
	запрос.УстановитьПараметр("МассивСкладов",МассивСкладов);
	запрос.УстановитьПараметр("МассивКоллекцийОбщий",МассивКоллекцийОбщий);	
	запрос.УстановитьПараметр("МассивКоллекцийОсновной",МассивКоллекцийОсновной);	
	запрос.УстановитьПараметр("МассивКоллекцийРаспродажный",МассивКоллекцийРаспродажный);	
	запрос.УстановитьПараметр("МассивВидовКомплекта",МассивВидовКомплекта);		
	запрос.УстановитьПараметр("Дата2",ТекущаяДата());
	
	Результат=запрос.Выполнить().Выбрать();
	ЗаписатьВЛог("Регламент","Начало выполнения установка активности элементов номенклатуры. Количество элементов ="+Строка(Результат.Количество())+". "+ СтрокаПараметров,"Информация");
	
	ВыводитьСообщения=ложь;
	#Если Клиент тогда
		ВыводитьСообщения=Истина;
	#КонецЕсли
	
	КоличествоЭлементов=0;
	
	Пока Результат.Следующий() цикл
		НоменклатураОбъект=Результат.Номенклатура.получитьОбъект();
		НоменклатураОбъект.ЖизненныйЦиклНоменклатуры=Перечисления.ЖизненныйЦиклНоменклатуры.Активна;
		попытка
			НоменклатураОбъект.записать();
			если ВыводитьСообщения тогда
				Сообщить("Установлена активность на "+НоменклатураОбъект);
			КонецЕсли;			
			КоличествоЭлементов=КоличествоЭлементов+1;
		Исключение
			ЗаписатьВЛог("Регламент","Не удалось записать "+НоменклатураОбъект.наименование+", "+ОписаниеОшибки(),"Информация");
			Продолжить;
		КонецПопытки;	
	КонецЦикла;
	
	ЗаписатьВЛог("Регламент","Завершение выполнения  установка активности номенклатуры. Обработано "+КоличествоЭлементов+" элементов","Информация");
	
	
	КоличествоЭлементов=0;
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	//Теперь снимаем  активность на элементы из МассивКоллекцийОсновной , которых нет на остатках + сняты с производства (1я табличка)
	//+  снимаем активность на элементы из МассивКоллекцийРаспродажный, которых нет на остатках   (2я табличка)
	//+ снимаем активность на элементы из которые не входят ни в 1 массив коллекций (3я табличка) 
	
	// Шворобей ВЮ 30.08.2023 ++
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ном.Ссылка, ВложенныйЗапрос.Номенклатура) КАК Номенклатура,
	|	СУММА(ЕСТЬNULL(ВложенныйЗапрос.Количество, 0)) КАК Количество
	|ИЗ
	|	Справочник.Номенклатура КАК ном
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	|			ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) КАК Количество
	|		ИЗ
	|			РегистрНакопления.ОстаткиТМЦ.Остатки(
	|					&Дата2,
	|					Склад В (&МассивСкладов)
	|						И Номенклатура В ИЕРАРХИИ (&МассивНоменклатуры)
	|						И Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	|						И Номенклатура.Родитель.Коллекция В (&МассивКоллекцийОсновной)
	|						И НЕ Номенклатура.ЭтоГруппа
	|						И Номенклатура.СнятСПроизводства
	|						И Номенклатура.ЖизненныйЦиклНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ЖизненныйЦиклНоменклатуры.Активна)) КАК ОстаткиТМЦОстатки
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	|						&Дата2,
	|						Склад В (&МассивСкладов)
	|							И Номенклатура В ИЕРАРХИИ (&МассивНоменклатуры)
	|							И Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	|							И Номенклатура.Родитель.Коллекция В (&МассивКоллекцийОсновной)
	|							И НЕ Номенклатура.ЭтоГруппа
	|							И Номенклатура.СнятСПроизводства
	|							И Номенклатура.ЖизненныйЦиклНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ЖизненныйЦиклНоменклатуры.Активна)) КАК РезервыТМЦОстатки
	|				ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
	|					И ОстаткиТМЦОстатки.Склад = РезервыТМЦОстатки.Склад) КАК ВложенныйЗапрос
	|		ПО ном.Ссылка = ВложенныйЗапрос.Номенклатура
	|ГДЕ
	|	НЕ ном.ПометкаУдаления
	|	И ном.Ссылка В ИЕРАРХИИ(&МассивНоменклатуры)
	|	И ном.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	|	И ном.Родитель.Коллекция В(&МассивКоллекцийОсновной)
	|	И ном.СнятСПроизводства
	|	И НЕ ном.ЭтоГруппа
	|	И ном.ЖизненныйЦиклНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ЖизненныйЦиклНоменклатуры.Активна)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ном.Ссылка, ВложенныйЗапрос.Номенклатура)
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЕСТЬNULL(ВложенныйЗапрос.Количество, 0)) <= 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ном.Ссылка, ВложенныйЗапрос.Номенклатура),
	|	СУММА(ЕСТЬNULL(ВложенныйЗапрос.Количество, 0))
	|ИЗ
	|	Справочник.Номенклатура КАК ном
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	|			ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) КАК Количество
	|		ИЗ
	|			РегистрНакопления.ОстаткиТМЦ.Остатки(
	|					&Дата2,
	|					Склад В (&МассивСкладов)
	|						И Номенклатура В ИЕРАРХИИ (&МассивНоменклатуры)
	|						И Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	|						И Номенклатура.Родитель.Коллекция В (&МассивКоллекцийРаспродажный)
	|						И НЕ Номенклатура.ЭтоГруппа
	|						И Номенклатура.ЖизненныйЦиклНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ЖизненныйЦиклНоменклатуры.Активна)) КАК ОстаткиТМЦОстатки
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	|						&Дата2,
	|						Склад В (&МассивСкладов)
	|							И Номенклатура В ИЕРАРХИИ (&МассивНоменклатуры)
	|							И Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	|							И Номенклатура.Родитель.Коллекция В (&МассивКоллекцийРаспродажный)
	|							И НЕ Номенклатура.ЭтоГруппа
	|							И Номенклатура.ЖизненныйЦиклНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ЖизненныйЦиклНоменклатуры.Активна)) КАК РезервыТМЦОстатки
	|				ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
	|					И ОстаткиТМЦОстатки.Склад = РезервыТМЦОстатки.Склад) КАК ВложенныйЗапрос
	|		ПО ном.Ссылка = ВложенныйЗапрос.Номенклатура
	|ГДЕ
	|	НЕ ном.ПометкаУдаления  
	//++Данилова Е.В. 29.10.2025 HELP-7654 
	//|	И НЕ ном.СнятСПроизводства 
	//--Данилова Е.В. 29.10.2025
	|	И НЕ ном.ЭтоГруппа
	|	И ном.Ссылка В ИЕРАРХИИ(&МассивНоменклатуры)
	|	И ном.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	|	И ном.Родитель.Коллекция В(&МассивКоллекцийРаспродажный)
	|	И ном.ЖизненныйЦиклНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ЖизненныйЦиклНоменклатуры.Активна)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ном.Ссылка, ВложенныйЗапрос.Номенклатура)
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЕСТЬNULL(ВложенныйЗапрос.Количество, 0)) <= 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ном.Ссылка,
	|	0
	|ИЗ
	|	Справочник.Номенклатура КАК ном
	|ГДЕ
	|	НЕ ном.ПометкаУдаления
	|	И НЕ ном.ЭтоГруппа
	|	И ном.Ссылка В ИЕРАРХИИ(&МассивНоменклатуры)
	|	И ном.ЖизненныйЦиклНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ЖизненныйЦиклНоменклатуры.Активна)
	|	И НЕ ном.Родитель.Коллекция В (&МассивКоллекцийОбщий)";	
	// Шворобей ВЮ 30.08.2023 ++
	
	Результат = Запрос.Выполнить().Выбрать();
	ЗаписатьВЛог("Регламент","Начало выполнения снятия активности элементов номенклатуры. Количество элементов = "+Строка(Результат.Количество()),"Информация");
	
	пока Результат.Следующий() цикл
		НоменклатураОбъект=Результат.Номенклатура.получитьОбъект();
		НоменклатураОбъект.ЖизненныйЦиклНоменклатуры=Перечисления.ЖизненныйЦиклНоменклатуры.Закрыта;
		попытка
			НоменклатураОбъект.записать();
			если ВыводитьСообщения тогда
				Сообщить("снята активность с "+НоменклатураОбъект);
			КонецЕсли;	
			КоличествоЭлементов=КоличествоЭлементов+1;
		Исключение
			ЗаписатьВЛог("Регламент","Не удалось записать "+НоменклатураОбъект.наименование+", "+ОписаниеОшибки(),"Информация");
			Продолжить;
		КонецПопытки;	
	КонецЦикла;
	ЗаписатьВЛог("Регламент","Завершение выполнения  снятия активности номенклатуры. Обработано "+КоличествоЭлементов+" элементов","Информация");
	
	
	
	КоличествоМоделей=0;
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	//Теперь   ставим признак выгружать на сайт на элемент из МассивКоллекцийОбщий, у которого есть хоть 1 активный элемент  (1я табличка)
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Родитель КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ЭтоГруппа
	|	И НЕ Номенклатура.ПометкаУдаления
	|	И Номенклатура.Родитель.Коллекция В(&МассивКоллекцийОбщий)
	//крохин началло 06.12.2022
	//по коллекциям "только для стильпарка" не устанавливаем "выгружать на b2b"
	|	И НЕ Номенклатура.Родитель.Коллекция В(&МассивКоллекцийСтильпарк)
	//крохин конец 06.12.2022
	|	И Номенклатура.Ссылка В ИЕРАРХИИ(&МассивНоменклатуры)
	|	И Номенклатура.ЖизненныйЦиклНоменклатуры = ЗНАЧЕНИЕ(перечисление.ЖизненныйЦиклНоменклатуры.Активна)
	|	И Номенклатура.Родитель.ВыгружатьВИнтернетМагазин <> ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)";
	
	//крохин началло 06.12.2022
	//по коллекциям "только для стильпарка" не устанавливаем "выгружать на b2b "
	запрос.УстановитьПараметр("МассивКоллекцийСтильпарк",МассивКоллекцийСтильпарк);
	//крохин конец 06.12.2022

	Результат=запрос.Выполнить().Выбрать();
	ЗаписатьВЛог("Регламент","Начало выполнения установки признака выгружать на сайт на модели. Количество моделей = "+Строка(Результат.Количество()),"Информация");
	
	пока Результат.Следующий() цикл
		НоменклатураОбъект=Результат.Номенклатура.получитьОбъект();
		НоменклатураОбъект.ВыгружатьВИнтернетМагазин=Перечисления.ВыгружатьНаСайт.Да;
		попытка
			НоменклатураОбъект.записать();
			если ВыводитьСообщения тогда
				Сообщить("Установлен признак выгружать на сайт для "+НоменклатураОбъект);
			КонецЕсли;	
			КоличествоМоделей=КоличествоМоделей+1;
		Исключение
			ЗаписатьВЛог("Регламент","Не удалось записать "+НоменклатураОбъект.наименование+", "+ОписаниеОшибки(),"Информация");
			Продолжить;
		КонецПопытки;	
	КонецЦикла;
	ЗаписатьВЛог("Регламент","Завершение выполнения установки признака выгружать на сайт. Обработано "+КоличествоМоделей+" элементов","Информация");
	
	КоличествоМоделей=0;	
	
	
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	//Теперь   снимаем признак выгружать на сайт на элемент из МассивКоллекцийОбщий, у которого нет ни 1го активного элемента  (3я табличка)
	//+ снимаем этот признак на модели не из массивов коллекций
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка КАК Номенклатура
	|ПОМЕСТИТЬ ТЗМоделей
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ПометкаУдаления
	|	И Номенклатура.Коллекция В(&МассивКоллекцийОбщий)
	|	И Номенклатура.ЭтоГруппа
	|	И Номенклатура.Ссылка В ИЕРАРХИИ(&МассивНоменклатуры)
	|	И Номенклатура.ВыгружатьВИнтернетМагазин = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура
	|ПОМЕСТИТЬ ТЗЭлементов
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ЭтоГруппа
	|	И НЕ Номенклатура.ПометкаУдаления
	|	И Номенклатура.Родитель.Коллекция В(&МассивКоллекцийОбщий)
	|	И Номенклатура.Ссылка В ИЕРАРХИИ(&МассивНоменклатуры)
	|	И Номенклатура.ЖизненныйЦиклНоменклатуры = ЗНАЧЕНИЕ(перечисление.ЖизненныйЦиклНоменклатуры.Активна)
	|	И Номенклатура.Родитель.ВыгружатьВИнтернетМагазин = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗМоделей.Номенклатура КАК Номенклатура
	|ИЗ
	|	ТЗМоделей КАК ТЗМоделей
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТЗЭлементов КАК ТЗЭлементов
	|		ПО ТЗМоделей.Номенклатура = ТЗЭлементов.Номенклатура.Родитель
	|ГДЕ
	|	ТЗЭлементов.Номенклатура ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ПометкаУдаления
	//крохин начало 06.12.2022
	//по коллекциям "только для стильпарка" не устанавливаем "выгружать на b2b"
	//|	И НЕ Номенклатура.Коллекция В (&МассивКоллекцийОбщий)
	|	И ((НЕ Номенклатура.Коллекция В (&МассивКоллекцийОбщий)) ИЛИ (Номенклатура.Коллекция В (&МассивКоллекцийСтильпарк)))
	//крохин конец 06.12.2022
	|	И Номенклатура.Ссылка В ИЕРАРХИИ(&МассивНоменклатуры)
	|	И Номенклатура.ЭтоГруппа
	|	И Номенклатура.ВыгружатьВИнтернетМагазин = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)";
	
	Результат=запрос.Выполнить().Выбрать();	
	ЗаписатьВЛог("Регламент","Начало выполнения снятия признака выгружать на сайт. Количество моделей = "+ Результат.Количество(),"Информация");
	КоличествоМоделей=0;
	
	пока Результат.Следующий() цикл
		НоменклатураОбъект=Результат.Номенклатура.получитьОбъект();
		НоменклатураОбъект.ВыгружатьВИнтернетМагазин=Перечисления.ВыгружатьНаСайт.Нет;
		попытка
			НоменклатураОбъект.записать();
			если ВыводитьСообщения тогда
				Сообщить("Снят признак выгружать на сайт для "+НоменклатураОбъект);
			КонецЕсли;	
			КоличествоМоделей=КоличествоМоделей+1;
		Исключение
			ЗаписатьВЛог("Регламент","Не удалось записать "+НоменклатураОбъект.наименование+", "+ОписаниеОшибки(),"Информация");
			Продолжить;
		КонецПопытки;	
	КонецЦикла;
	
	
	
	
	// Кухарь А.Ю.  27.12.2023 начало
	если МассивУстаревшейНоменклатуры.Количество()>0 тогда
		Запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ВыгружатьВИнтернетМагазин = &Да
		|	И Номенклатура.Ссылка В ИЕРАРХИИ(&МассивУстаревшейНоменклатуры)";
		запрос.УстановитьПараметр("МассивУстаревшейНоменклатуры",МассивУстаревшейНоменклатуры);
		запрос.УстановитьПараметр("Да",Перечисления.ВыгружатьНаСайт.Да);
		
		Результат=запрос.Выполнить().Выбрать();
		пока Результат.Следующий() цикл
			НоменклатураОбъект=Результат.Номенклатура.получитьОбъект();
			НоменклатураОбъект.ВыгружатьВИнтернетМагазин=Перечисления.ВыгружатьНаСайт.Нет;
			попытка
				НоменклатураОбъект.записать();
				если ВыводитьСообщения тогда
					Сообщить("Снят признак выгружать на сайт для "+НоменклатураОбъект);
				КонецЕсли;	
				КоличествоМоделей=КоличествоМоделей+1;
			Исключение
				ЗаписатьВЛог("Регламент","Не удалось записать "+НоменклатураОбъект.наименование+", "+ОписаниеОшибки(),"Информация");
				Продолжить;
			КонецПопытки;				
		КонецЦикла;		
		
		
		Запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В ИЕРАРХИИ(&МассивУстаревшейНоменклатуры)
		|	И Номенклатура.ЖизненныйЦиклНоменклатуры = &Активна";
		запрос.УстановитьПараметр("МассивУстаревшейНоменклатуры",МассивУстаревшейНоменклатуры);
		запрос.УстановитьПараметр("Активна",Перечисления.ЖизненныйЦиклНоменклатуры.Активна);
		
		Результат=запрос.Выполнить().Выбрать();
		пока Результат.Следующий() цикл
			НоменклатураОбъект=Результат.Номенклатура.получитьОбъект();
			НоменклатураОбъект.ЖизненныйЦиклНоменклатуры=Перечисления.ЖизненныйЦиклНоменклатуры.Закрыта;
			попытка
				НоменклатураОбъект.записать();
				если ВыводитьСообщения тогда
					Сообщить("снята активность с "+НоменклатураОбъект);
				КонецЕсли;	
				КоличествоЭлементов=КоличествоЭлементов+1;
			Исключение
				ЗаписатьВЛог("Регламент","Не удалось записать "+НоменклатураОбъект.наименование+", "+ОписаниеОшибки(),"Информация");
				Продолжить;
			КонецПопытки;				
		КонецЦикла;		

	КонецЕсли;
	// Кухарь А.Ю.  27.12.2023 конец
	//---------------------------------------------------------------------------------------------------------------------------------
	// нечаева 10,01,23+++
	// для активных элементов, у котороых выгружать на б2б = истина, проверяем цены, по типу цен - обцл и сейл опт. Если обе цены = 0, тогда активночть ставим= "нет"
	// сделано, чтобы не выгружать мусор на сайт.  По товарам без цены отправляется письмо, на прописаные емайлы.
	
	ПроверкаЦен(ТипЦен1,ТипЦен2,МассивЕмайлов,ВыводитьСообщения);

	
	// нечаева 10,01,23---
	///---------------------------------------------------------------------------------------------------------------------------------
	// Нечаева 29,09,23++++
	// после того, как все отработало, для товаров у которых выгружать на б2б= истина, и не распродажа мы ставим по справочнику 
	// - узлы для выгрузки на сайт.
	
	// Выберем все настройки по узлам.
	Запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	НастройкиОбменаМонобрендовыхСайтов.УзелОбмена КАК УзелОбмена
	               |ИЗ
	               |	Справочник.НастройкиОбменаМонобрендовыхСайтов КАК НастройкиОбменаМонобрендовыхСайтов
	               |ГДЕ
	               |	НастройкиОбменаМонобрендовыхСайтов.ПометкаУдаления = ложь";
	СписокУзлов = Запрос.Выполнить().Выгрузить();	
	
	Для каждого текУзел из СписокУзлов цикл
		
		//выберем все бренды по узлу
		Запрос = новый запрос;
		запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	НастройкиОбменаМонобрендовыхСайтовУзлы.БрендФР КАК БрендФР
		               |ИЗ
		               |	Справочник.НастройкиОбменаМонобрендовыхСайтов.Узлы КАК НастройкиОбменаМонобрендовыхСайтовУзлы
		               |ГДЕ
		               |	НастройкиОбменаМонобрендовыхСайтовУзлы.Активность =  &Активна
		               |	И НастройкиОбменаМонобрендовыхСайтовУзлы.Ссылка.ПометкаУдаления = ЛОЖЬ
		               |	И НастройкиОбменаМонобрендовыхСайтовУзлы.Ссылка.УзелОбмена = &ТекУзел";
		
		Запрос.УстановитьПараметр("Активна",перечисления.ВыгружатьНаСайт.Да);
		Запрос.УстановитьПараметр("ТекУзел",текузел.УзелОбмена);

		СписокБрендов = Запрос.Выполнить().Выгрузить();
		Сп2=СписокБрендов.ВыгрузитьКолонку("БрендФР");	

		//--------------------------------------------------------------------------------------------
		// сделаем для одного сайта, по одному узлу обмена.
					
		ЗаполнитьУзлыВыгрузкиМонобрендов(МассивКоллекцийРаспродажный,Сп2,текузел.УзелОбмена,выводитьсообщения);
		
	КонецЦикла;
	// нечаева 29.09,23----
	 
	
	
	ЗаписатьВЛог("Регламент","Завершение выполнения снятия признака выгружать на сайт. Обработано "+КоличествоМоделей+" элементов","Информация");
КонецПроцедуры



// нечаева 09,01,24+++
Процедура ПроверкаЦен(ТипЦен1=неопределено,ТипЦен2=неопределено,СписокЕмайлов=неопределено,ВыводитьСообщения)
	
	//  все товары у которых  выгружать на б2б = истина и обе цены = 0 
	
	Запрос=Новый Запрос;     
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Модель,
	               |	ЦеныНоменклатурыСрезПоследних.ТипЦен КАК ТипЦен,
	               |	ЦеныНоменклатурыСрезПоследних.Прайс.Дата КАК ДатаПрайса,
	               |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	               |ПОМЕСТИТЬ Цены
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |			&Дата2 {(&Дата2)},
	               |			Прайс.Проведен
	               |				И Прайс.Дата2 >= &Дата2 {(ТипЦен).*}) КАК ЦеныНоменклатурыСрезПоследних
	               |ГДЕ
	               |	ЦеныНоменклатурыСрезПоследних.ТипЦен = &Тектипцен1
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Модель,
	               |	ТипЦен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(Цены.ДатаПрайса) КАК ДатаПрайса,
	               |	Цены.Модель КАК Модель,
	               |	Цены.ТипЦен КАК ТипЦен
	               |ПОМЕСТИТЬ Прайсы
	               |ИЗ
	               |	Цены КАК Цены
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Цены.ТипЦен,
	               |	Цены.Модель
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Модель,
	               |	ЦеныНоменклатурыСрезПоследних.ТипЦен КАК ТипЦен,
	               |	ЦеныНоменклатурыСрезПоследних.Прайс.Дата КАК ДатаПрайса,
	               |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	               |ПОМЕСТИТЬ Цены2
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |			&Дата2 {(&Дата2)},
	               |			Прайс.Проведен
	               |				И Прайс.Дата2 >= &Дата2 {(ТипЦен).*}) КАК ЦеныНоменклатурыСрезПоследних
	               |ГДЕ
	               |	ЦеныНоменклатурыСрезПоследних.ТипЦен = &Тектипцен2
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Модель,
	               |	ТипЦен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(Цены2.ДатаПрайса) КАК ДатаПрайса,
	               |	Цены2.Модель КАК Модель,
	               |	Цены2.ТипЦен КАК ТипЦен
	               |ПОМЕСТИТЬ Прайсы2
	               |ИЗ
	               |	Цены2 КАК Цены2
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Цены2.ТипЦен,
	               |	Цены2.Модель
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Прайсы.Модель КАК Модель,
	               |	Прайсы.ТипЦен КАК ТипЦен,
	               |	Цены.Цена КАК Цена1
	               |ПОМЕСТИТЬ ИтогоЦены1
	               |ИЗ
	               |	Прайсы КАК Прайсы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Цены КАК Цены
	               |		ПО (Цены.Модель = Прайсы.Модель)
	               |			И (Цены.ТипЦен = Прайсы.ТипЦен)
	               |			И (Цены.ДатаПрайса = Прайсы.ДатаПрайса)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Прайсы2.Модель КАК Модель,
	               |	Прайсы2.ТипЦен КАК ТипЦен,
	               |	Цены2.Цена КАК Цена2
	               |ПОМЕСТИТЬ ИтогоЦены2
	               |ИЗ
	               |	Прайсы2 КАК Прайсы2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Цены2 КАК Цены2
	               |		ПО (Цены2.Модель = Прайсы2.Модель)
	               |			И (Цены2.ТипЦен = Прайсы2.ТипЦен)
	               |			И (Цены2.ДатаПрайса = Прайсы2.ДатаПрайса)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Ном.Родитель КАК Группа,
	               |	ИтогоЦены1.Цена1 КАК Цена1,
	               |	ИтогоЦены2.Цена2 КАК Цена2
	               |ИЗ
	               |	Справочник.Номенклатура КАК Ном
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ИтогоЦены2 КАК ИтогоЦены2
	               |		ПО (ИтогоЦены2.Модель = Ном.Родитель)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ИтогоЦены1 КАК ИтогоЦены1
	               |		ПО (ИтогоЦены1.Модель = Ном.Родитель)
	               |ГДЕ
	             //  |	Ном.Ссылка В ИЕРАРХИИ(&ТекНом) и
	               |	НЕ Ном.ЭтоГруппа
	               |	И ВЫБОР
	               |			КОГДА Ном.Ссылка.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	               |				ТОГДА ""Да""
	               |			КОГДА Ном.Ссылка.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	               |				ТОГДА ""Нет""
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА Ном.Ссылка.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	               |						ТОГДА ""Да""
	               |					КОГДА Ном.Ссылка.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	               |						ТОГДА ""Нет""
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	               |								ТОГДА ""Да""
	               |							КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	               |								ТОГДА ""Нет""
	               |							ИНАЧЕ ВЫБОР
	               |									КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	               |										ТОГДА ""Да""
	               |									КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	               |										ТОГДА ""Нет""
	               |									ИНАЧЕ ""Нет""
	               |								КОНЕЦ
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ = ""Да""
	               |	И ИтогоЦены1.Цена1 ЕСТЬ NULL
	               |	И ИтогоЦены2.Цена2 ЕСТЬ NULL";
	Запрос.УстановитьПараметр("Дата2",конецдня(текущаядата()));
	Запрос.УстановитьПараметр("ТекНом",справочники.Номенклатура.НайтиПоКоду("SNL-414140"));
	
	Если типцен1=неопределено ТОгда
		ТипЦен1=Справочники.ТипыЦен.НайтиПоКоду("SNL-0229"); //обцл
		ТипЦен2=Справочники.ТипыЦен.НайтиПоКоду("SSP-0314");  // сейл опт отповая розница
		ТипЦен3=Справочники.ТипыЦен.НайтиПоКоду("SNL-0584");  // SALE ТР (точечная розница))
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТекТипЦен1",ТипЦен1);
	Запрос.УстановитьПараметр("Тектипцен2",ТипЦен2);
	
	СписокНомПОСайту=Запрос.Выполнить().Выгрузить();
	если ВыводитьСообщения тогда
		Сообщить(" Количество выгружаемого товара у которого нет цен - "+СписокНомПОСайту.Количество());	
	КонецЕсли;
	//++Данилова Е.В. 15.09.2025 без задачи 
	ОшибкиЗаписиТоваров = Новый Массив; 
	//--Данилова Е.В. 15.09.2025	
	// тут все у которых нет активного, а нужен.
	Для каждого Текстрока из  СписокНомПОСайту цикл
	
			  ТекОБ=ТекСтрока.Группа.получитьОбъект();
			  ТекОб.ВыгружатьВИнтернетМагазин = перечисления.ВыгружатьНаСайт.Нет;
			  //++Данилова Е.В. 15.09.2025 без задачи
			 // ТекОБ.Записать();
			  Попытка
			  
			  	 ТекОБ.Записать();
			  
			  Исключение
			     ОшибкиЗаписиТоваров.Добавить(ТекОБ.ссылка);
				 Продолжить; 
			  КонецПопытки;
			   
			  //--Данилова Е.В. 15.09.2025
			 если ВыводитьСообщения тогда
				 
				 сообщить("++ "+Текстрока.группа+" нет цен, активность снята" );
				 //++Данилова Е.В. 29.11.2024
				 ЗаписатьВЛог("Регламент","++ "+Текстрока.группа+" нет цен, ВыгружатьВИнтернетМагазин установлен в Нет","Информация"); 
				 //--Данилова Е.В. 29.11.2024
			 конецЕсли;                           
		
	КонецЦикла;
	// снятие активности закончено
	//------------------------------------------------------------------------------------
	Если СписокНомПОСайту.Количество()>0 Тогда
		
		СообщитьКритОшибки(СписокЕмайлов,СписокНомПОСайту);
		
	КонецЕсли; 
	
	//++Данилова Е.В. 15.09.2025  без задачи 
	Если ОшибкиЗаписиТоваров.Количество()>0 Тогда 
		
		СписокПолучателей = Новый Массив;
		СписокПолучателей.Добавить("chelnokova@collant.ru"); 
		СообщитьОшибкиПриЗаписи(СписокПолучателей,ОшибкиЗаписиТоваров);
		
	КонецЕсли; 
	//--Данилова Е.В. 15.09.2025
	
	
КонецПроцедуры  


Процедура СообщитьКритОшибки(СписокЕмайлов,СписокНомПОСайту) Экспорт
		
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);		 
	
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	//------------------------------------------------
	// сообщение о критических ошибках
	//------------------------------------------------
	сообщениеКрит=новый интернетПочтовоеСообщение;
	
	//Катаев+ 07/05/13 получатели критических ошибок будем брать из Регистра сведений
	//СообщениеКрит.Получатели.Добавить("nechaeva@collant.ru");
	//СообщениеКрит.Получатели.Добавить("krohin@collant.ru");
	Если СписокЕмайлов.количество()>0 ТОгда
		Для рр=0 по СписокЕмайлов.Количество()-1 Цикл
			СообщениеКрит.Получатели.Добавить(СписокЕмайлов[рр]);
		КонецЦикла;

	КонецЕсли;
	
	сообщениеКрит.Отправитель="ecode@collant.ru";
	СообщениеКрит.Тема="Автообмен б2б. Нулевые цены !";
	Строка="Добрый день!!!"+Символ(13)+" Нулевые цены по моделям -" +Символ(13);
	НомСтр=1;
	
	
	Если СписокНомПОСайту.Количество()>0 Тогда
		Для рр=0 по СписокНомПОСайту.Количество()-1 Цикл
			Строка=""+Строка+НомСтр+". "+СписокНомПОСайту[рр].группа.код +" - "+СписокНомПОСайту[рр].группа+" ";
			Строка=Строка+Символ(10)+символ(13);
			НомСтр=НомСтр+1;
		КонецЦикла;
	КонецЕсли;
	
	Строка=Строка+Символ(13)+"________________________________________________________________";
	//-----------------------------------------
	СообщениеКрит.Тексты.Добавить(Строка);

	
	Почта= Новый ИнтернетПочта;
	попытка
		Почта.Подключиться(Профиль);
		почта.Послать(СообщениеКрит);
		Почта.Отключиться();
	исключение
		ЗаписатьВЛог("б2б","Не возможно подключиться к почте, для отправке сообщений по ценам! "+ОписаниеОшибки(),"Информация");
		//сообщить(ОписаниеОшибки());
	конецПопытки;
	
КонецПроцедуры
// нечаева 09,01,24---
//++Данилова Е.В. 15.09.2025 без задачи 
Процедура СообщитьОшибкиПриЗаписи(СписокПолучателей,СписокТоваровПроблемаЗаписи) Экспорт
		
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);		 
	
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	
	//------------------------------------------------
	// сообщение о критических ошибках
	//------------------------------------------------
	сообщениеКрит = новый интернетПочтовоеСообщение;

	Если СписокПолучателей.количество()>0 ТОгда
		Для каждого ПолучательП Из СписокПолучателей Цикл
		
			СообщениеКрит.Получатели.Добавить(ПолучательП);	
		
		КонецЦикла; 		

	КонецЕсли;
	
	сообщениеКрит.Отправитель="ecode@collant.ru";
	СообщениеКрит.Тема="Автообмен б2б. Нулевые цены ! Ошибка перезаписи номенклатуры!";
	Строка="Добрый день!!!"+Символ(13)+" Ошибка перезаписи группы товаров -" +Символ(13);
	НомСтр=1;
	
	
	Если СписокТоваровПроблемаЗаписи.Количество()>0 Тогда
		Для каждого ТоварПроблемный Из СписокТоваровПроблемаЗаписи Цикл  
			
			Строка=""+Строка+Строка(ТоварПроблемный)+". "+ТоварПроблемный.Родитель.код +" - "+Строка(ТоварПроблемный.Родитель)+" ";
			Строка=Строка+Символ(10)+символ(13);
			НомСтр=НомСтр+1;  
			
		КонецЦикла;
	КонецЕсли;
	
	Строка=Строка+Символ(13)+"________________________________________________________________";
	//-----------------------------------------
	СообщениеКрит.Тексты.Добавить(Строка);

	
	Почта= Новый ИнтернетПочта;
	попытка
		Почта.Подключиться(Профиль);
		почта.Послать(СообщениеКрит);
		Почта.Отключиться();
	исключение
		ЗаписатьВЛог("б2б","Не возможно подключиться к почте, для отправке сообщений по ценам! "+ОписаниеОшибки(),"Информация");
		//сообщить(ОписаниеОшибки());
	конецПопытки;
	
КонецПроцедуры

//--Данилова Е.В. 15.09.2025


// нечаева 04,10,23+++
Процедура ЗаполнитьУзлыВыгрузкиМонобрендов(МассивКоллекцийРаспродажный,СписокБрендов,УзелОбмена,ВыводитьСообщения)
	
	// Выгружать нужно по всем товарам у которых  выгружать на б2б = истина и не распродажные модели.
	// бренды для выгрузки по узлам прописаны в справочнике.
	
	
	//часть 1
	// выбираем всю номенклатуру, установка активности.  (выберем те, у которых активность не проставлена и только их заполним)
	Запрос=Новый Запрос;     
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Ном.Ссылка.Родитель КАК Модель,
	               |	Ном.Родитель.ФР_Бренд КАК ФР_Бренд,
	               |	Ном.Родитель.Наименование КАК Наименование,
	               |	ВложенныйЗапрос.УзелОбмена КАК УзелОбмена,
	               |	ВложенныйЗапрос.Активность КАК Активность,
	               |	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки
	               |ПОМЕСТИТЬ ТЗМоделей
	               |ИЗ
	               |	Справочник.Номенклатура КАК Ном
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			НоменклатураПолучателиИзмененийНоменклатуры.Ссылка КАК Ссылка,
	               |			НоменклатураПолучателиИзмененийНоменклатуры.узелОбмена КАК УзелОбмена,
	               |			НоменклатураПолучателиИзмененийНоменклатуры.Активность КАК Активность,
	               |			НоменклатураПолучателиИзмененийНоменклатуры.НомерСтроки КАК НомерСтроки
	               |		ИЗ
	               |			Справочник.Номенклатура.ПолучателиИзмененийНоменклатуры КАК НоменклатураПолучателиИзмененийНоменклатуры
	               |		ГДЕ
	               |			НоменклатураПолучателиИзмененийНоменклатуры.узелОбмена = &ТекУзел) КАК ВложенныйЗапрос
	               |		ПО Ном.Родитель = ВложенныйЗапрос.Ссылка
	               |ГДЕ
	               |	НЕ Ном.ЭтоГруппа
	               |	И ВЫБОР
	               |			КОГДА Ном.Ссылка.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	               |				ТОГДА ""Да""
	               |			КОГДА Ном.Ссылка.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	               |				ТОГДА ""Нет""
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА Ном.Ссылка.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	               |						ТОГДА ""Да""
	               |					КОГДА Ном.Ссылка.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	               |						ТОГДА ""Нет""
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	               |								ТОГДА ""Да""
	               |							КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	               |								ТОГДА ""Нет""
	               |							ИНАЧЕ ВЫБОР
	               |									КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	               |										ТОГДА ""Да""
	               |									КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	               |										ТОГДА ""Нет""
	               |									ИНАЧЕ ""Нет""
	               |								КОНЕЦ
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ = ""Да""
	               |	И Ном.Родитель.ФР_Бренд В(&СписокБрендов)
	               |	И НЕ Ном.Родитель.Коллекция В (&МассивКоллекцийРаспродажный)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗМоделей.Модель КАК Модель,
	               |	ТЗМоделей.УзелОбмена КАК УзелОбмена,
	               |	ТЗМоделей.Активность КАК Активность,
	               |	ТЗМоделей.НомерСтроки КАК НомерСтроки
	               |ИЗ
	               |	ТЗМоделей КАК ТЗМоделей
	               |ГДЕ
	               |	(ТЗМоделей.Активность ЕСТЬ NULL
	               |			ИЛИ ТЗМоделей.Активность = НЕОПРЕДЕЛЕНО
	               |			ИЛИ ТЗМоделей.Активность = &ПустоеЗначение
	               |			ИЛИ ТЗМоделей.Активность = &Активность)";
	Запрос.УстановитьПараметр("МассивКоллекцийРаспродажный",МассивКоллекцийРаспродажный);
	Запрос.УстановитьПараметр("Активность",перечисления.ВыгружатьНаСайт.Нет);
	Запрос.УстановитьПараметр("ТекУзел",УзелОбмена);
	Запрос.УстановитьПараметр("СписокБрендов",СписокБрендов);
	Запрос.УстановитьПараметр("ПустоеЗначение",перечисления.ВыгружатьНаСайт.ПустаяСсылка());

	// все типы брендов соберем.
	
	СписокНомПОСайту=Запрос.Выполнить().Выгрузить();
	если ВыводитьСообщения тогда
		Сообщить(" Количество выгружаемого товара установка активности - "+СписокНомПОСайту.Количество()+ " узел обмена "+УзелОбмена);	
	КонецЕсли;

	
	// тут все у которых нет активного, а нужен.
	Для каждого Текстрока из  СписокНомПОСайту цикл
		  
		  Если  ТекСтрока.НомерСтроки = Null или ТекСтрока.НомерСтроки = неопределено Тогда
			  // добавим
			  ТекОБ=ТекСтрока.Модель.получитьОбъект();
			  НовУзел = ТекОб.ПолучателиИзмененийНоменклатуры.добавить();
			  НовУзел.УзелОбмена = УзелОбмена;
			  НовУзел.активность = перечисления.ВыгружатьНаСайт.Да;
			  ТекОБ.Записать();
			 // сообщить(Текстрока.модель);
		  Иначе
			  // сделаем активную строку.
			  ТекОБ=ТекСтрока.Модель.получитьОбъект();
			  ТекСтр = ТекОб.ПолучателиИзмененийНоменклатуры[Текстрока.НомерСтроки-1];
			  ТекСтр.УзелОбмена = УзелОбмена;
			  ТекСтр.активность = перечисления.ВыгружатьНаСайт.Да;
			  ТекОБ.Записать();
			//  сообщить("++ "+Текстрока.модель);

		  КонецЕсли;	  
		
	КонецЦикла;
	// часть 2. снятие активности для остальных товаров. распродажные тоже смотрим, вдруг они раньше выгружались.
	//------------------------------------------------------------------------------------------------------------
	
	Запрос=Новый Запрос;     

	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Ном.Ссылка.Родитель КАК Модель,
	               |	Ном.Родитель.ФР_Бренд КАК ФР_Бренд,
	               |	Ном.Родитель.Наименование КАК Наименование,
	               |	ВложенныйЗапрос.УзелОбмена КАК УзелОбмена,
	               |	ВложенныйЗапрос.Активность КАК Активность,
	               |	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки
	               |ПОМЕСТИТЬ ТЗМоделей
	               |ИЗ
	               |	Справочник.Номенклатура КАК Ном
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			НоменклатураПолучателиИзмененийНоменклатуры.Ссылка КАК Ссылка,
	               |			НоменклатураПолучателиИзмененийНоменклатуры.узелОбмена КАК УзелОбмена,
	               |			НоменклатураПолучателиИзмененийНоменклатуры.Активность КАК Активность,
	               |			НоменклатураПолучателиИзмененийНоменклатуры.НомерСтроки КАК НомерСтроки
	               |		ИЗ
	               |			Справочник.Номенклатура.ПолучателиИзмененийНоменклатуры КАК НоменклатураПолучателиИзмененийНоменклатуры
	               |		ГДЕ
	               |			НоменклатураПолучателиИзмененийНоменклатуры.узелОбмена = &ТекУзел) КАК ВложенныйЗапрос
	               |		ПО Ном.Родитель = ВложенныйЗапрос.Ссылка
	               |ГДЕ
	               |	НЕ Ном.ЭтоГруппа
	               |	И ВЫБОР
	               |			КОГДА Ном.Ссылка.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	               |				ТОГДА ""Да""
	               |			КОГДА Ном.Ссылка.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	               |				ТОГДА ""Нет""
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА Ном.Ссылка.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	               |						ТОГДА ""Да""
	               |					КОГДА Ном.Ссылка.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	               |						ТОГДА ""Нет""
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	               |								ТОГДА ""Да""
	               |							КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	               |								ТОГДА ""Нет""
	               |							ИНАЧЕ ВЫБОР
	               |									КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	               |										ТОГДА ""Да""
	               |									КОГДА Ном.Ссылка.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
	               |										ТОГДА ""Нет""
	               |									ИНАЧЕ ""Нет""
	               |								КОНЕЦ
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ = ""Нет""
	               |	И Ном.Родитель.ФР_Бренд В(&СписокБрендов)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗМоделей.Модель КАК Модель,
	               |	ТЗМоделей.УзелОбмена КАК УзелОбмена,
	               |	ТЗМоделей.Активность КАК Активность,
	               |	ТЗМоделей.НомерСтроки КАК НомерСтроки
	               |ИЗ
	               |	ТЗМоделей КАК ТЗМоделей
	               |ГДЕ
	               |	( ТЗМоделей.Активность = &Активность)";
	Запрос.УстановитьПараметр("МассивКоллекцийРаспродажный",МассивКоллекцийРаспродажный);
	Запрос.УстановитьПараметр("Активность",перечисления.ВыгружатьНаСайт.Да);
	Запрос.УстановитьПараметр("ТекУзел",УзелОбмена);
	Запрос.УстановитьПараметр("СписокБрендов",СписокБрендов);
	
	СписокНомПОСайту=Запрос.Выполнить().Выгрузить();
	если ВыводитьСообщения тогда

		Сообщить(" Количество выгружаемого товара снятие активности - "+СписокНомПОСайту.Количество()+ " узел обмена "+УзелОбмена);	
	КонецЕсли;
	
	// тут все у которых нет активного, а нужен.
	Для каждого Текстрока из  СписокНомПОСайту цикл
	
			  ТекОБ=ТекСтрока.Модель.получитьОбъект();
			  ТекСтр = ТекОб.ПолучателиИзмененийНоменклатуры[Текстрока.НомерСтроки-1];
			  ТекСтр.УзелОбмена = УзелОбмена;
			  ТекСтр.активность = перечисления.ВыгружатьНаСайт.Нет;
			  ТекОБ.Записать();
			//  сообщить("++ "+Текстрока.модель);
		
	КонецЦикла;
	// снятие активности для остальных товаров.
	//------------------------------------------------------------------------------------
	
		
КонецПроцедуры
// нечаева 04,10,23---
